{"Introdução": " Foi lançada por Guido van Rossum em 1991. Prioriza a legibilidade do código sobre a velocidade ou expressividade.", " História ": " Mas ela não possuía funcionalidades importantes para a interação com o sistema operacional, uma necessidade do grupo. Também estava presente nessa versão um sistema de módulos emprestado do Modula-3. Novas funcionalidades incluíam ferramentas para programação funcional como lambda, map, filter e reduce. A última versão enquanto Guido estava na CWI foi o Python 1.2. Em 1995, ele continuou o trabalho no CNRI em Reston, Estados Unidos, de onde lançou diversas versões. Entre outras mudanças, essa licença incluía uma cláusula atestando que a licença era governada pelas leis da Virgínia. A Free Software Foundation alegou que isso era incompatível com a GNU GPL. Sua licença foi renomeada para Python Software Foundation License. O lançamento incluiu a mudança na especificação para suportar escopo aninhado, assim como outras linguagens com escopo estático. Isto tornou o modelo de objetos do Python consistentemente orientado a objeto. Em Python 2.6, isso já está disponível ao adicionar o código from __future__ import print_function. Uma das principais linguagens escolhidas é Python. A linguagem se tornou a padrão no curso de ciências da computação do MIT em 2009", " Filosofia ": " Pode-se vê-lo através de um easter egg do Python pelo comando:", "= Construções ": " =Construções de Python incluem: estrutura de seleção (if, else, elif); estrutura de repetição (for, while), que itera por um container, capturando cada elemento em uma variável local dada; construção de classes (class); construção de sub-rotinas (def); construção de escopo (with), como por exemplo para adquirir um recurso.", "= Tipos de dado ": " São disponibilizados diversos tipos de dados nativos:Python também permite a definição dos tipos de dados próprios, através de classes. Instâncias são construídas invocando a classe (FooClass()), e as classes são instância da classe type, o que permite metaprogramação e reflexão. As classes new-styles nada mais são que tipos definidos pelo usuário.", "= Palavras reservadas ": " =O Python 3 define as seguintes palavras reservadas:", "= Operadores ": " =Os operadores básicos de comparação como", "= Interpretador interativo ": " Por exemplo, y", "= Análise léxica ": "  0 or x/y > 100 nunca lançará a exceção de divisão por zero.", "== Indentação ": " Por exemplo:"}